{
    "An error occurred while performing the action. Please try again or contact support.": "Ocorreu um erro ao executar a ação. Tente novamente ou entre em contato com o suporte.",
    "An error was encountered while trying to apply the rules required for the action. Please try again or contact support.": "Foi encontrado um erro ao tentar aplicar as regras necessárias para a ação. Tente novamente ou entre em contato com o suporte.",
    "An error occurred while trying to perform the action on the database. Please try again or contact support.": "Ocorreu um erro ao tentar executar a ação na base de dados. Tente novamente ou entre em contato com o suporte.",
    "The record cannot be inactivated because it still has outstanding monetary balances.": "O registro não pode ser inativado porque ainda tem saldos monetários pendentes.",

    "The reported record was not found.": "O registro relatado não foi encontrado.",

    "Function not yet implemented.": "Função ainda não implementada.",
    "Data created successfully.": "Registro criado com sucesso.",
    "Data updated successfully.": "Registro atualizado com sucesso.",
    "Data deleted successfully.": "Registro removido com sucesso.",

    "Owner": "Dono",

    "Wallet": "Carteira",
    "Standard Owner's Wallet": "Carteira padrão de :owner",
    "Welcome :name": "Bom dia :name",
    "The :attribute field must contain only letters, numbers, periods, dashes and spaces.": "O campo :attribute deve conter apenas letras, números, pontos, traços e espaços.",
    "It is necessary to inform who this wallet belongs to.": "É necessário informar a quem pertence esta Carteira.",
    "A wallet marked as main cannot be inactive.": "Uma Carteira marcada como principal não pode estar inativa ou ser inativada.",
    "A wallet cannot be unmarked as the main wallet.": "Uma Carteira não pode ser desmarcada como sendo a principal.",
    "The main wallet of an account cannot be unmarked as such.": "A Carteira principal de uma conta não pode desmarcada como tal.",
    "It is not allowed to create a Wallet from inactive Owners.": "Não é permitido a criação de uma Carteira a partir de Donos inativos.",
    "It is not allowed to activate a Wallet whose Owner is inactive.": "Não é permitido a ativação de uma Carteira cujo Dono esteja inativo.",
    "It is not allowed to inactivate the main Wallet.": "Não é permitido a inativação da Carteira principal.",
    "It is not allowed to inactivate a Wallet that has outstanding monetary balances.": "Não é permitido a inativação de uma Carteira que possua pendências.",
    "It is not allowed to remove the main Wallet.": "Não é permitido a remoção da Carteira principal.",
    "It is not allowed to remove a Wallet that has outstanding monetary balances.": "Não é permitido a remoção de uma Carteira que possua pendências.",

    "Payment Method": "Método de Pagamento",
    "Notes": "Cédulas e/ou Moedas",
    "Transfer": "Transações Bancárias",
    "Debit": "Débito",
    "Credit": "Crédito",

    "Transaction Type": "Tipo de Transação",
    "Banal": "Banal",
    "Relevant": "Relevante",
    "Indispensable": "Importante",

    "": ""
}
